Revit 2024 API
FolderItemInfo Class
 Contains data for each folder item in the organization settings of the project browser including folder parameter Id and folder name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class FolderItemInfo : IDisposable
Visual Basic
Public Class FolderItemInfo _
	Implements IDisposable
Visual C++
public ref class FolderItemInfo : IDisposable
Remarks
 FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FolderItemInfo
See Also
FolderItemInfo Members
Autodesk.Revit.DB Namespace